benchmarkResults/highload_messaging.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: benchmark.js
        output: -

     scenarios: (100.00%) 1 scenario, 200 max VUs, 1m0s max duration (incl. graceful stop):
              * highload_messaging: 200 looping VUs for 30s (exec: highLoadMessaging, gracefulStop: 30s)


running (0m01.0s), 200/200 VUs, 6107 complete and 0 interrupted iterations
highload_messaging   [   3% ] 200 VUs  01.0s/30s

running (0m02.0s), 200/200 VUs, 11755 complete and 0 interrupted iterations
highload_messaging   [   7% ] 200 VUs  02.0s/30s

running (0m03.0s), 200/200 VUs, 18244 complete and 0 interrupted iterations
highload_messaging   [  10% ] 200 VUs  03.0s/30s

running (0m04.0s), 200/200 VUs, 21485 complete and 0 interrupted iterations
highload_messaging   [  13% ] 200 VUs  04.0s/30s

running (0m05.0s), 200/200 VUs, 22841 complete and 0 interrupted iterations
highload_messaging   [  17% ] 200 VUs  05.0s/30s

running (0m06.0s), 200/200 VUs, 23948 complete and 0 interrupted iterations
highload_messaging   [  20% ] 200 VUs  06.0s/30s

running (0m07.0s), 200/200 VUs, 26276 complete and 0 interrupted iterations
highload_messaging   [  23% ] 200 VUs  07.0s/30s

running (0m08.0s), 200/200 VUs, 28173 complete and 0 interrupted iterations
highload_messaging   [  27% ] 200 VUs  08.0s/30s

running (0m09.0s), 200/200 VUs, 32181 complete and 0 interrupted iterations
highload_messaging   [  30% ] 200 VUs  09.0s/30s

running (0m10.0s), 200/200 VUs, 36386 complete and 0 interrupted iterations
highload_messaging   [  33% ] 200 VUs  10.0s/30s

running (0m11.0s), 200/200 VUs, 41161 complete and 0 interrupted iterations
highload_messaging   [  37% ] 200 VUs  11.0s/30s

running (0m12.0s), 200/200 VUs, 46321 complete and 0 interrupted iterations
highload_messaging   [  40% ] 200 VUs  12.0s/30s

running (0m13.0s), 200/200 VUs, 52729 complete and 0 interrupted iterations
highload_messaging   [  43% ] 200 VUs  13.0s/30s

running (0m14.0s), 200/200 VUs, 57766 complete and 0 interrupted iterations
highload_messaging   [  47% ] 200 VUs  14.0s/30s

running (0m15.0s), 200/200 VUs, 59796 complete and 0 interrupted iterations
highload_messaging   [  50% ] 200 VUs  15.0s/30s

running (0m16.0s), 200/200 VUs, 62252 complete and 0 interrupted iterations
highload_messaging   [  53% ] 200 VUs  16.0s/30s

running (0m17.0s), 200/200 VUs, 66267 complete and 0 interrupted iterations
highload_messaging   [  57% ] 200 VUs  17.0s/30s

running (0m18.0s), 200/200 VUs, 72236 complete and 0 interrupted iterations
highload_messaging   [  60% ] 200 VUs  18.0s/30s

running (0m19.0s), 200/200 VUs, 79366 complete and 0 interrupted iterations
highload_messaging   [  63% ] 200 VUs  19.0s/30s

running (0m20.0s), 200/200 VUs, 85571 complete and 0 interrupted iterations
highload_messaging   [  67% ] 200 VUs  20.0s/30s

running (0m21.0s), 200/200 VUs, 91593 complete and 0 interrupted iterations
highload_messaging   [  70% ] 200 VUs  21.0s/30s

running (0m22.0s), 200/200 VUs, 98229 complete and 0 interrupted iterations
highload_messaging   [  73% ] 200 VUs  22.0s/30s

running (0m23.0s), 200/200 VUs, 103869 complete and 0 interrupted iterations
highload_messaging   [  77% ] 200 VUs  23.0s/30s

running (0m24.0s), 200/200 VUs, 110287 complete and 0 interrupted iterations
highload_messaging   [  80% ] 200 VUs  24.0s/30s

running (0m25.0s), 200/200 VUs, 116738 complete and 0 interrupted iterations
highload_messaging   [  83% ] 200 VUs  25.0s/30s

running (0m26.0s), 200/200 VUs, 122481 complete and 0 interrupted iterations
highload_messaging   [  87% ] 200 VUs  26.0s/30s

running (0m27.0s), 200/200 VUs, 128332 complete and 0 interrupted iterations
highload_messaging   [  90% ] 200 VUs  27.0s/30s

running (0m28.0s), 200/200 VUs, 134535 complete and 0 interrupted iterations
highload_messaging   [  93% ] 200 VUs  28.0s/30s

running (0m29.0s), 200/200 VUs, 139972 complete and 0 interrupted iterations
highload_messaging   [  97% ] 200 VUs  29.0s/30s

running (0m30.0s), 200/200 VUs, 147355 complete and 0 interrupted iterations
highload_messaging   [ 100% ] 200 VUs  30.0s/30s
     ✗ [highload_messaging] status 200
      ↳  99% — ✓ 147719 / ✗ 58

     checks.........................: 99.96% ✓ 147719      ✗ 58    
     data_received..................: 96 MB  3.2 MB/s
     data_sent......................: 13 MB  433 kB/s
     http_req_blocked...............: avg=8.3µs   min=0s      med=1µs     max=10.09ms  p(90)=2µs     p(95)=4µs    
     http_req_connecting............: avg=6.29µs  min=0s      med=0s      max=5.18ms   p(90)=0s      p(95)=0s     
   ✓ http_req_duration..............: avg=40.54ms min=4.12ms  med=32.13ms max=679.12ms p(90)=60.95ms p(95)=87.38ms
       { expected_response:true }...: avg=40.56ms min=12.93ms med=32.13ms max=679.12ms p(90)=60.96ms p(95)=87.4ms 
     http_req_failed................: 0.03%  ✓ 58          ✗ 147719
     http_req_receiving.............: avg=19.39µs min=0s      med=10µs    max=23.59ms  p(90)=31µs    p(95)=55µs   
     http_req_sending...............: avg=4.72µs  min=1µs     med=3µs     max=10.47ms  p(90)=7µs     p(95)=13µs   
     http_req_tls_handshaking.......: avg=0s      min=0s      med=0s      max=0s       p(90)=0s      p(95)=0s     
     http_req_waiting...............: avg=40.52ms min=4.11ms  med=32.1ms  max=679.1ms  p(90)=60.92ms p(95)=87.31ms
     http_reqs......................: 147777 4923.786875/s
     iteration_duration.............: avg=40.6ms  min=6.81ms  med=32.17ms max=679.16ms p(90)=61ms    p(95)=87.44ms
     iterations.....................: 147777 4923.786875/s
     vus............................: 200    min=200       max=200 
     vus_max........................: 200    min=200       max=200 
running (0m30.0s), 000/200 VUs, 147777 complete and 0 interrupted iterations
highload_messaging ✓ [ 100% ] 200 VUs  30s